[
  {
    "id": 1,
    "title": "Part 1: Web Development 101",
    "paragraph 1": "Was the first week of bootcamp what I expected? Somehow the answer is both yes and no.
                    Yes in that I knew I'd be facing challenges and blockers since this is so new to me and I definitely have had some struggles getting things to work how I wanted.
                    But no in that I thought we'd jump right into programming languages, I didn't even think about the stuff you'd need to know beforehand!
                    Though to be fair, I didn't really know anything about the CLI and how to naivgate that with its various commands or about Github and its usefulness in collaborations 
                    but now I do and understand why we'd need a good grasp of these concepts before diving into any language.",
    "paragraph 2": "I'm definitely excited to get into programming languages now to get some powerful tools in my belt. That way I can start designing my blog to look as cool as I'm picturing in my head! It's so interesting to browse through portfolio examples from past students or even 
                    just on Google seeing different professionals and their websites and knowing I'm just a few months of being capable of emulating that is such an exciting feeling. I have a little experience with the Adobe Creative Suite and Figma and I'm really excited to learn how to integrate that with my new programming capabilities."
    "paragraph 3": "I'd like my blog to showcase my education and career journey as well as projects that may personally interest me. Maybe even add links to articles and videos I've found helpful. The amount of things I'm learning everyday is overwhelming to say the least, but if I can show how I was able to overcome each obstacle maybe 
                    I could help someone else down the line. It's so amazing to see the awesome things my mentors' and peers' are able to put out everyday and they inspire me to be more awesome too!"
    "date": "8/23/2021 - 8/27/2021",
    "type": "Onboarding"
  },
  {
      "id": 2,
      "title": "Part 2: HTML and CSS headaches",
      "description": "My second week",
      "date": "8/30/2021 - 9/3/2021",
      "type": "Onboarding"
  }

]